KozhinovAlexander/zephyr_vscode_workspace/stm32_svd/STM32WL30.svd
This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register.

0: No half transfer (HT) event on channel 3

1: A half transfer (HT) event occurred on channel 3</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TE1F3</name>
              <description>TEIF3: Channel 3 transfer error flag                                                                                                                                                                                                                    This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register.

0: No transfer error (TE) on channel 3

1: A transfer error (TE) occurred on channel 3</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GIF4</name>
              <description>GIF4: Channel 4 global interrupt flag

This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register.

0: No TE, HT or TC event on channel 4

1: A TE, HT or TC event occurred on channel 4</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TCIF4</name>
              <description>TCIF4: Channel 4 transfer complete flag

This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register.

0: No transfer complete (TC) event on channel 4

1: A transfer complete (TC) event occurred on channel 4</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HTIF4</name>
              <description>HTIF4: Channel 4 half transfer flag

This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register.

0: No half transfer (HT) event on channel 4

1: A half transfer (HT) event occurred on channel 4</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TE1F4</name>
              <description>TEIF4: Channel 4 transfer error flag                                                                                                                                                                                                                    This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register.

0: No transfer error (TE) on channel 4

1: A transfer error (TE) occurred on channel 4</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GIF5</name>
              <description>GIF5: Channel 5 global interrupt flag

This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register.

0: No TE, HT or TC event on channel 5

1: A TE, HT or TC event occurred on channel 5</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TCIF5</name>
              <description>TCIF5: Channel 5 transfer complete flag

This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register.

0: No transfer complete (TC) event on channel 5

1: A transfer complete (TC) event occurred on channel 5</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HTIF5</name>
              <description>HTIF5: Channel 5 half transfer flag

This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register.

0: No half transfer (HT) event on channel 5

1: A half transfer (HT) event occurred on channel 5</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TE1F5</name>
              <description>TEIF5: Channel 5 transfer error flag                                                                                                                                                                                                                    This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register.

0: No transfer error (TE) on channel 5

1: A transfer error (TE) occurred on channel 5</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GIF6</name>
              <description>GIF6: Channel 6 global interrupt flag

This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register.

0: No TE, HT or TC event on channel 6

1: A TE, HT or TC event occurred on channel 6</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TCIF6</name>
              <description>TCIF6: Channel 6 transfer complete flag

This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register.

