KozhinovAlexander/zephyr_vscode_workspace/stm32_svd/STM32WL30.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>FLASH_CTRL</name>
      <description>4kb addressable space</description>
      <groupName>FLASH_CTRL</groupName>
      <baseAddress>0x40001000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x200</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>Flash</name>
        <description>Non-volatile memory (flash)
controller</description>
        <value>0</value>
      </interrupt>
      <registers>
        <register>
          <name>COMMAND</name>
          <displayName>COMMAND</displayName>
          <description>COMMAND register</description>
          <addressOffset>0x00</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>COMMAND</name>
              <description>Macro commands for flash operations (may require DATA0...DATA3 to be set):
- 0x11 : ERASE        
- 0x22 : MASSERASE    
- 0x33 : WRITE           
- 0x55 : MASSREAD            
- 0xAA : SLEEP        
- 0xBB : WAKEUP       
- 0xCC : BURSTWRITE   
- 0xEE : OTPWRITE     
- 0xFF : KEYWRITE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFIG</name>
          <displayName>CONFIG</displayName>
          <description>CONFIG register</description>
          <addressOffset>0x04</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>REMAP</name>
              <description>CPU access routing (it supersedes PREMAP configuration):
- 0 : FLASH memory addressed
- 1 : SRAM0 memory addressed</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIS_GROUP_WRITE</name>
              <description>Burst write Control:
- 0 : burst write allowed
- 1 : burst write forbidden</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAIT_STATE</name>
              <description>Add latency to flash read opeations:
- 00 : no latency
- 01 : 1 clock cycle latency
- 10 : 2 clock cycles latency
- 11 : 3 clock cycles latency</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLEEP_SM</name>
              <description>Flash memory power-down mode enable in SLEEP mode
This bit allows to have the Flash memory in power-down mode or in idle mode when the
device is in Sleep mode.
- 0: When the device is in Sleep mode, the NVM is in Idle mode.
- 1: When the device is in Sleep mode, the NVM is in power-down mode.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IRQSTAT</name>
          <displayName>IRQSTAT</displayName>
          <description>IRQSTAT register</description>
          <addressOffset>0x08</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CMDDONE_MIS</name>
              <description>(1: clear, 0: inactive) CMDDONE_MIS flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMDSTART_MIS</name>
              <description>(1: clear, 0: inactive) CMDSTART_MIS flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMDBUSYERR_MIS</name>
              <description>(1: clear, 0: inactive) CMDBUSYERR_MIS flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ILLCMD_MIS</name>
              <description>(1: clear, 0: inactive) ILLCMD_MIS flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READOK_MIS</name>
              <description>(1: clear, 0: inactive) READOK_MIS flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FNREADY_MIS</name>
              <description>(1: clear, 0: inactive) FNREADY_MIS flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IRQMASK</name>
          <displayName>IRQMASK</displayName>
          <description>IRQMASK register</description>
          <addressOffset>0x0C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000003F</resetValue>
          <fields>
            <field>
              <name>CMDDONEM</name>
              <description>(1: mask, 0: inactive) CMDDONE_MIS mask</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMDSTARTM</name>
              <description>(1: mask, 0: inactive) CMDSTART_MIS mask</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMDBUSYERRM</name>
              <description>(1: mask, 0: inactive) CMDBUSYERR_MIS mask</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ILLCMDM</name>
              <description>(1: mask, 0: inactive) ILLCMD_MIS mask</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READOKM</name>
              <description>(1: mask, 0: inactive) READOK_MIS mask</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FNREADYM</name>
              <description>(1: mask, 0: inactive) FNREADY_MIS mask</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IRQRAW</name>
          <displayName>IRQRAW</displayName>
          <description>IRQRAW register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>CMDDONE_RIS</name>
              <description>(1: active, 0: inactive) COMMAND sequence ended</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMDSTART_RIS</name>
              <description>(1: active, 0: inactive) COMMAND sequence started</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMDBUSYERR_RIS</name>
              <description>(1: active, 0: inactive) COMMAND issued while flash busy</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ILLCMD_RIS</name>
              <description>(1: active, 0: inactive) Illegal command issued</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READOK_RIS</name>
              <description>(1: active, 0: inactive) READ COMMAND completed successfully</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMDSLEEPERR_RIS</name>
              <description>(1: active, 0: inactive) COMMAND issued while flash in sleep-mode (SLM=1)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SIZE</name>
          <displayName>SIZE</displayName>
          <description>SIZE register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x0000FFFF</resetValue>
          <fields>
            <field>
              <name>FLASH_SIZE</name>
              <description>Maximum valid address for flash memory:
- 00 : 0x03FFF (64kb)
- 01 : 0x07FFF (128kb)
- 10 : 0x0BFFF (192kb)
- 11 : 0x0FFFF (256kb)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>17</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RAM_SIZE</name>
              <description>RAM memory size selection:
- 0 : 16kb
- 1 : 32kb</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FLASH_SECURE</name>
              <description>Flash memory protection (0: no key present, 1: key present)</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>JTAG_DISABLE</name>
              <description>Flash+JTAG protection (0: no JTAG protection - see FLASH_SECURE, 1: Flash and JTAG protected)</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PACKAGE_SIZE</name>
              <description>Package selection:
- 0- : CSP
- 10 : 32pins
- 11 : 48pins</description>
              <bitOffset>21</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADDRESS</name>
          <displayName>ADDRESS</displayName>
          <description>ADDRESS register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>YADDR</name>
              <description>Flash column address offset to be used with some COMMAND</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XADDR</name>
              <description>Flash row address offset to be used with some COMMAND</description>
              <bitOffset>6</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LFSRVAL</name>
          <displayName>LFSRVAL</displayName>
          <description>LFSRVAL register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>LFSRVAL</name>
              <description>Flash read data CRC signature</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PAGEPROT0</name>
          <displayName>PAGEPROT0</displayName>
          <description>PAGEPROT0 register</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SEGSIZE0</name>
              <description>First segment, 7-bit page protection size (number of pages to protect in segment, first page included)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEGOFFSET0</name>
              <description>First segment, 7-bit page protection offset (first page number in protected segment)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEGSIZE1</name>
              <description>Second segment, 7-bit page protection size (number of pages to protect in segment, first page included)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEGOFFSET1</name>
              <description>Second segment, 7-bit page protection offset (first page number in protected segment)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PAGEPROT1</name>
          <displayName>PAGEPROT1</displayName>
          <description>PAGEPROT1 register</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SEGSIZE2</name>
              <description>Third segment, 7-bit page protection size (number of pages to protect in segment, first page included)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEGOFFSET2</name>
              <description>Third segment, 7-bit page protection offset (first page number in protected segment)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEGSIZE3</name>
              <description>Fourth segment, 7-bit page protection size (number of pages to protect in segment, first page included)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEGOFFSET3</name>
              <description>Fourth segment, 7-bit page protection offset (first page number in protected segment)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATA0</name>
          <displayName>DATA0</displayName>
          <description>DATA0 register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>DATA0</name>
              <description>Value to be used as DATA for any COMMAND of type WRITE and compare value for MASSREAD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATA1</name>
          <displayName>DATA1</displayName>
          <description>DATA1 register</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>DATA1</name>
              <description>Value to be used as DATA for any COMMAND of type WRITE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATA2</name>
          <displayName>DATA2</displayName>
          <description>DATA2 register</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>DATA2</name>
              <description>Value to be used as DATA for any COMMAND of type WRITE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATA3</name>
          <displayName>DATA3</displayName>
          <description>DATA3 register</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>DATA3</name>
              <description>Value to be used as DATA for any COMMAND of type WRITE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UNLOCK012</name>
          <displayName>UNLOCK012</displayName>
          <description>UNLOCK012 register</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>UNLOCK012</name>
              <description>(NOT TO BE DOCUMENTED) Remove read-write protection from IFR0, IFR1, IFR2 sectors</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UNLOCK3</name>
          <displayName>UNLOCK3</displayName>
          <description>UNLOCK3 register</description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>UNLOCK3</name>
              <description>(NOT TO BE DOCUMENTED) Remove read-write protection from IFR3 sector</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
