KozhinovAlexander/zephyr_vscode_workspace/stm32_svd/STM32WL30.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>LPUART</name>
      <groupName>LPUART</groupName>
      <baseAddress>0x41005000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x30</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LPUART</name>
        <description>LPUART interrupt</description>
        <value>9</value>
      </interrupt>
      <registers>
        <register>
          <name>CR1</name>
          <displayName>CR1</displayName>
          <description>CR1 register</description>
          <addressOffset>0x00</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>UE</name>
              <description>UE: USART enable
When this bit is cleared, the USART prescalers and outputs are stopped immediately, and
current operations are discarded. The configuration of the USART is kept, but all the status
flags, in the USART_ISR are reset. This bit is set and cleared by software.
-0: USART prescaler and outputs disabled, low power mode
-1: USART enabled</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UESM</name>
              <description>UESM: LPUART enable in Stop mode
When this bit is cleared, the LPUART is not able to wake up the MCU from Stop mode.
When this bit is set, the LPUART is able to wake up the MCU from Stop mode, provided that
the LPUART clock selection is LSE in the RCC.
This bit is set and cleared by software.
-0: LPUART not able to wake up the MCU from Stop mode.
-1: LPUART able to wake up the MCU from Stop mode. When this function is active, the
clock source for the LPUART must be LSE (see RCC chapter)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RE</name>
              <description>RE: Receiver enable
This bit enables the receiver. It is set and cleared by software.
-0: Receiver is disabled
-1: Receiver is enabled and begins searching for a start bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TE</name>
              <description>TE: Transmitter enable
This bit enables the transmitter. It is set and cleared by software.
-0: Transmitter is disabled
-1: Transmitter is enabled</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IDLEIE</name>
              <description>IDLEIE: IDLE interrupt enable
This bit is set and cleared by software.
-0: Interrupt is inhibited
-1: A USART interrupt is generated whenever IDLE=1 in the USART_ISR register</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXNEIE_RXFNEIE</name>
              <description>RXNEIE/RXFNEIE: Receive data register not empty/RXFIFO not empty interrupt enable
This bit is set and cleared by software.
-0: Interrupt is inhibited
-1: An USART interrupt is generated whenever ORE=1 or RXNE/RXFNE=1 in the
USART_ISR register</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TCIE</name>
              <description>TCIE: Transmission complete interrupt enable
This bit is set and cleared by software.
-0: Interrupt is inhibited
-1: A USART interrupt is generated whenever TC=1 in the USART_ISR register</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXEIE_TXFNFIE</name>
              <description>TXEIE/TXFNFIE: Transmit data regsiter empty/TXFIFO not full interrupt enable
This bit is set and cleared by software.
-0: Interrupt is inhibited
-1: A USART interrupt is generated whenever TXE/TXFNF =1 in the USART_ISR register</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PEIE</name>
              <description>PEIE: PE interrupt enable
This bit is set and cleared by software.
-0: Interrupt is inhibited
-1: A USART interrupt is generated whenever PE=1 in the USART_ISR register</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PS</name>
              <description>PS: Parity selection
This bit selects the odd or even parity when the parity generation/detection is enabled (PCE
bit set). It is set and cleared by software. The parity will be selected after the current byte.
-0: Even parity
-1: Odd parity
This bit field can only be written when the USART is disabled (UE=0).</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PCE</name>
              <description>PCE: Parity control enable
This bit selects the hardware parity control (generation and detection). When the parity
control is enabled, the computed parity is inserted at the MSB position (9th bit if M=1; 8th bit
if M=0) and parity is checked on the received data. This bit is set and cleared by software.
Once it is set, PCE is active after the current byte (in reception and in transmission).
-0: Parity control disabled
-1: Parity control enabled
This bit field can only be written when the USART is disabled (UE=0).</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAKE</name>
              <description>WAKE: Receiver wakeup method
This bit determines the USART wakeup method from Mute mode. It is set or cleared by
software.
-0: Idle line
-1: Address mark
This bit field can only be written when the USART is disabled (UE=0).</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>M_0</name>
              <description>M0: Word length
This bit, with bit 28 (M1) determine the word length. It is set or cleared by software. See Bit
-28 (M1)description.
This bit can only be written when the USART is disabled (UE=0).</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MME</name>
              <description>MME: Mute mode enable
This bit activates the mute mode function of the USART. When set, the USART can switch
between the active and mute modes, as defined by the WAKE bit. It is set and cleared by
software.
-0: Receiver in active mode permanently
-1: Receiver can switch between mute mode and active mode</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMIE</name>
              <description>CMIE: Character match interrupt enable
This bit is set and cleared by software.
-0: Interrupt is inhibited
-1: A USART interrupt is generated when the CMF bit is set in the USART_ISR register.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DEDT</name>
              <description>DEDT[4:0]: Driver Enable deassertion time
This 5-bit value defines the time between the end of the last stop bit, in a transmitted
message, and the de-activation of the DE (Driver Enable) signal. It is expressed in sample
time units (1/8 or 1/16 bit time, depending on the oversampling rate).
If the USART_TDR register is written during the DEDT time, the new data is transmitted only
when the DEDT and DEAT times have both elapsed.
This bit field can only be written when the USART is disabled (UE=0).</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DEAT</name>
              <description>DEAT[4:0]: Driver Enable assertion time
This 5-bit value defines the time between the activation of the DE (Driver Enable) signal and
the beginning of the start bit. It is expressed in sample time units (1/8 or 1/16 bit time,
depending on the oversampling rate).
This bit field can only be written when the USART is disabled (UE=0).</description>
              <bitOffset>21</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>M_1</name>
              <description>Word length
This bit, with bit 12 (M0) determine the word length. It is set or cleared by software.
M[1:0] = 00: 1 Start bit, 8 Data bits, n Stop bit
M[1:0] = 01: 1 Start bit, 9 Data bits, n Stop bit
M[1:0] = 10: 1 Start bit, 7 Data bits, n Stop bit
This bit can only be written when the USART is disabled (UE=0).s</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FIFOEN</name>
              <description>FIFOEN :FIFO mode enable
This bit is set and cleared by software.
-0: FIFO mode is disabled.
-1: FIFO mode is enabled.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXFEIE</name>
              <description>TXFEIE :TXFIFO empty interrupt enable
This bit is set and cleared by software.
-0: Interrupt is inhibited
-1: An USART interrupt is generated when TXFE=1 in the USART_ISR register</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXFFIE</name>
              <description>RXFFIE :RXFIFO Full interrupt enable
This bit is set and cleared by software.
-0: Interrupt is inhibited
-1: An USART interrupt is generated when RXFF=1 in the USART_ISR register</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CR2</name>
          <displayName>CR2</displayName>
          <description>CR2 register</description>
          <addressOffset>0x04</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ADDM7</name>
              <description>ADDM7:7-bit Address Detection/4-bit Address Detection
This bit is for selection between 4-bit address detection or 7-bit address detection.
-0: 4-bit address detection
-1: 7-bit address detection (in 8-bit data mode)
This bit can only be written when the USART is disabled (UE=0)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STOP</name>
              <description>STOP[1:0]: STOP bits
These bits are used for programming the stop bits.
-00: 1 stop bit
-01: 0.5 stop bit.
-10: 2 stop bits
-11: 1.5 stop bits
This bit field can only be written when the USART is disabled (UE=0).</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SWAP</name>
              <description>SWAP: Swap TX/RX pins
This bit is set and cleared by software.
-0: TX/RX pins are used as defined in standard pinout
-1: The TX and RX pins functions are swapped. This allows to work in the case of a cross-wired
connection to another UART.
This bit field can only be written when the USART is disabled (UE=0).</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXINV</name>
              <description>RXINV: RX pin active level inversion
This bit is set and cleared by software.
-0: RX pin signal works using the standard logic levels (VDD =1/idle, Gnd=0/mark)
-1: RX pin signal values are inverted. ((VDD =0/mark, Gnd=1/idle).
This allows the use of an external inverter on the RX line.
This bit field can only be written when the USART is disabled (UE=0).</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXINV</name>
              <description>TXINV: TX pin active level inversion
This bit is set and cleared by software.
-0: TX pin signal works using the standard logic levels (VDD =1/idle, Gnd=0/mark)
-1: TX pin signal values are inverted. ((VDD =0/mark, Gnd=1/idle).
This allows the use of an external inverter on the TX line.
This bit field can only be written when the USART is disabled (UE=0).</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATAINV</name>
              <description>DATAINV: Binary data inversion
This bit is set and cleared by software.
-0: Logical data from the data register are send/received in positive/direct logic. (1=H, 0=L)
-1: Logical data from the data register are send/received in negative/inverse logic. (1=L, 0=H). The
parity bit is also inverted.
This bit field can only be written when the USART is disabled (UE=0).</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MSBFIRST</name>
              <description>MSBFIRST: Most significant bit first
This bit is set and cleared by software.
-0: data is transmitted/received with data bit 0 first, following the start bit.
-1: data is transmitted/received with the MSB (bit 7/8) first, following the start bit.
This bit field can only be written when the USART is disabled (UE=0).</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADD</name>
              <description>ADD[7:0]: Address of the USART node
This bit-field gives the address of the USART node or a character code to be recognized.
This is used in multiprocessor communication during Mute mode or Stop mode, for wakeup with 7-
bit address mark detection. The MSB of the character sent by the transmitter should be equal to 1.
It may also be used for character detection during normal reception, Mute mode inactive (for
example, end of block detection in ModBus protocol). In this case, the whole received character (8-
bit) is compared to the ADD[7:0] value and CMF flag is set on match.
This bit field can only be written when reception is disabled (RE = 0) or the USART is disabled
(UE=0)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
