KozhinovAlexander/zephyr_vscode_workspace/stm32_svd/STM32WL30.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>MR_SUBG</name>
      <groupName>MR_SUBG</groupName>
      <baseAddress>0x49000000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>MR_SUBG_BUSY</name>
        <description>MR_SUBG Busy interrupt</description>
        <value>20</value>
      </interrupt>
      <interrupt>
        <name>MR_SUBG</name>
        <description>MR_SUBG interrupt</description>
        <value>21</value>
      </interrupt>
      <interrupt>
        <name>TX_RX_SEQUENCE</name>
        <description>MR_SUBG TX/RX Sequence
interrupt</description>
        <value>22</value>
      </interrupt>
      <registers>
        <register>
          <name>RF_FSM0_TIMEOUT</name>
          <displayName>RF_FSM0_TIMEOUT</displayName>
          <description>RF_FSM0_TIMEOUT register</description>
          <addressOffset>0x00</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ENA_RFREG_TIMER</name>
              <description>Timeout for the RF regulator startup (duration in ENA_RF_REG state)
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_FSM1_TIMEOUT</name>
          <displayName>RF_FSM1_TIMEOUT</displayName>
          <description>RF_FSM1_TIMEOUT register</description>
          <addressOffset>0x04</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000006</resetValue>
          <fields>
            <field>
              <name>SYNTH_SETUP_TIMER</name>
              <description>Timeout management for the RF regulator to stabilize after RF PLL power on
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_FSM2_TIMEOUT</name>
          <displayName>RF_FSM2_TIMEOUT</displayName>
          <description>RF_FSM2_TIMEOUT register</description>
          <addressOffset>0x08</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000050</resetValue>
          <fields>
            <field>
              <name>VCO_CALIB_LOCK_TIMER</name>
              <description>Timeout for the RF PLL calibration + RF PLL lock (duration in CALIB_VCO+LOCKRXTX state)
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_FSM3_TIMEOUT</name>
          <displayName>RF_FSM3_TIMEOUT</displayName>
          <description>RF_FSM3_TIMEOUT register</description>
          <addressOffset>0x0C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000028</resetValue>
          <fields>
            <field>
              <name>VCO_LOCK_TIMER</name>
              <description>Timeout for the RF PLL lock event when no calibration is requested (duration in LOCKRXTX state)
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_FSM4_TIMEOUT</name>
          <displayName>RF_FSM4_TIMEOUT</displayName>
          <description>RF_FSM4_TIMEOUT register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000000F</resetValue>
          <fields>
            <field>
              <name>EN_RX_TIMER</name>
              <description>Timeout for the analog RX chain setup (duration in EN_RX state)
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_FSM5_TIMEOUT</name>
          <displayName>RF_FSM5_TIMEOUT</displayName>
          <description>RF_FSM5_TIMEOUT register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000019</resetValue>
          <fields>
            <field>
              <name>EN_PA_TIMER</name>
              <description>Timeout for the analog PA (DAC) setup (duration in EN_PA state)
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_FSM6_TIMEOUT</name>
          <displayName>RF_FSM6_TIMEOUT</displayName>
          <description>RF_FSM6_TIMEOUT register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000019</resetValue>
          <fields>
            <field>
              <name>PA_DWN_ANA_TIMER</name>
              <description>Timeout for the analog PA (DAC) ramp down (duration in PA_DWN_ANA state)
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_FSM7_TIMEOUT</name>
          <displayName>RF_FSM7_TIMEOUT</displayName>
          <description>RF_FSM7_TIMEOUT register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000005</resetValue>
          <fields>
            <field>
              <name>EN_LNA_TIMER</name>
              <description>Timeout for the analog RX chain signals settlement once PGA precharge is shut down (duration in EN_LNA state)
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AFC0_CONFIG</name>
          <displayName>AFC0_CONFIG</displayName>
          <description>AFC0_CONFIG register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000025</resetValue>
          <fields>
            <field>
              <name>AFC_SLOW_GAIN_LOG2</name>
              <description>AFC loop gain in slow mode (2's log)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AFC_FAST_GAIN_LOG2</name>
              <description>AFC loop gain in fast mode (2's log)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AFC1_CONFIG</name>
          <displayName>AFC1_CONFIG</displayName>
          <description>AFC1_CONFIG register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000018</resetValue>
          <fields>
            <field>
              <name>AFC_FAST_PERIOD</name>
              <description>Length of the AFC fast period (in number of samples unit)
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AFC2_CONFIG</name>
          <displayName>AFC2_CONFIG</displayName>
          <description>AFC2_CONFIG register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x000000C8</resetValue>
          <fields>
            <field>
              <name>AFC_PD_LEAKAGE</name>
              <description>AFC Peak Detection leakage.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AFC_MODE</name>
              <description>Select AFC mode: 
</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AFC_EN</name>
              <description>Enable AFC.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AFC_FREEZE_ON_SYNC</name>
              <description>Freeze AFC correction upon SYNC word detection</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AFC3_CONFIG</name>
          <displayName>AFC3_CONFIG</displayName>
          <description>AFC3_CONFIG register</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x000000E8</resetValue>
          <fields>
            <field>
              <name>AFC_INIT_MODE</name>
              <description>Control the initialization phase of the AFC and clock recovery algorithms:
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AFC_SIGN_PERM_CHECK</name>
              <description>Enable the check of sign permanence of AFC corrected signal.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AFC_TH_SIGN_PERM</name>
              <description>Threshold of chech sign permanence mechanism.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AFC_REINIT_OPTION</name>
              <description>Select the AFC reinitialization option:
</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLKREC_CTRL0</name>
          <displayName>CLKREC_CTRL0</displayName>
          <description>CLKREC_CTRL0 register</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x000000B8</resetValue>
          <fields>
            <field>
              <name>CLKREC_I_GAIN_FAST</name>
              <description>Integral fast gain for the clock recovery loop (PLL mode only)
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLKREC_P_GAIN_FAST</name>
              <description>Clock recovery fast loop gain (log2)
</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PSTFLT_LEN</name>
              <description>Control the length of the demodulator post-filter
</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLKREC_CTRL1</name>
          <displayName>CLKREC_CTRL1</displayName>
          <description>CLKREC_CTRL1 register</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000005C</resetValue>
          <fields>
            <field>
              <name>CLKREC_I_GAIN_SLOW</name>
              <description>Integral slow gain for the clock recovery loop (PLL mode only)
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLKREC_P_GAIN_SLOW</name>
              <description>Clock recovery slow loop gain (log2)
</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLKREC_ALGO_SEL</name>
              <description>Symbol timing recovery algorithm selection
</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCREM_CTRL0</name>
          <displayName>DCREM_CTRL0</displayName>
          <description>DCREM_CTRL0 register</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x000000E8</resetValue>
          <fields>
            <field>
              <name>START_GAIN</name>
              <description>Filter gain in start mode for the DC removal block.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRACK_GAIN</name>
              <description>Filter gain in track mode for the DC removal block.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IQC_CTRL0</name>
          <displayName>IQC_CTRL0</displayName>
          <description>IQC_CTRL0 register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x000000E3</resetValue>
          <fields>
            <field>
              <name>FAST_GAIN</name>
              <description>Gain of the correction loop in fast mode.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLOW_GAIN</name>
              <description>Gain of the correction loop in slow mode.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IQC_CTRL1</name>
          <displayName>IQC_CTRL1</displayName>
          <description>IQC_CTRL1 register</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000008</resetValue>
          <fields>
            <field>
              <name>QPD_ATTACK</name>
              <description>Attack coefficient for QPD:
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IQC_CTRL2</name>
          <displayName>IQC_CTRL2</displayName>
          <description>IQC_CTRL2 register</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000008</resetValue>
          <fields>
            <field>
              <name>QPD_DECAY</name>
              <description>Decay coefficient for QPD:
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IQC_CTRL3</name>
          <displayName>IQC_CTRL3</displayName>
          <description>IQC_CTRL3 register</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000007</resetValue>
          <fields>
            <field>
              <name>FAST_TIME</name>
              <description>Duration of the fast mode.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC_ANA_ENG</name>
          <displayName>AGC_ANA_ENG</displayName>
          <description>AGC_ANA_ENG register</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FORCE_AGC_GAINS</name>
              <description>Select the mode for AGC analog part:
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RFD_RX_ATTEN_AGCGAIN</name>
              <description>Attenuation at LNA level by step of 6dB with thermometric code:
</description>
              <bitOffset>1</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RFD_RX_PGA_AGCGAIN</name>
              <description>Attenuation at PGA level by step of 6dB with binary code:
</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC0_CTRL</name>
          <displayName>AGC0_CTRL</displayName>
          <description>AGC0_CTRL register</description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000099</resetValue>
          <fields>
            <field>
              <name>AGC_HOLD_TIME</name>
              <description>AGC hold time.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AGC_START_ONHOLD</name>
              <description>Start the AGC with a hold phase.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AGC_EN</name>
              <description>Enable the AGC
</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC1_CTRL</name>
          <displayName>AGC1_CTRL</displayName>
          <description>AGC1_CTRL register</description>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000062</resetValue>
          <fields>
            <field>
              <name>AGC_MIN_THR</name>
              <description>Minimum signal threshold.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AGC_MAX_THR</name>
              <description>Maximum signal threshold.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC2_CTRL</name>
          <displayName>AGC2_CTRL</displayName>
          <description>AGC2_CTRL register</description>
          <addressOffset>0x5C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x000000AF</resetValue>
          <fields>
            <field>
              <name>AGC_MEAS_TIME</name>
              <description>Measure time.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AGC_START_MAX_ATTEN</name>
              <description>Start the AGC with maximum attenuation.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AGC_FREEZE_ON_SYNC</name>
              <description>Enable the freeze on SYNC detection feature</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AGC_FREEZE_ON_STEADY</name>
              <description>Enable the autofreeze feature</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AGC_HIGH_ATTEN_MODE</name>
              <description>Enable the high attenuation mode.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC3_CTRL</name>
          <displayName>AGC3_CTRL</displayName>
          <description>AGC3_CTRL register</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000090</resetValue>
          <fields>
            <field>
              <name>AGC_MIN_ATTEN</name>
              <description>Minimum AGC attenuation.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AGC_MAX_ATTEN</name>
              <description>Maximum AGC attenuation.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
