KozhinovAlexander/zephyr_vscode_workspace/stm32_svd/STM32WL30.svd
        <register>
          <name>DBGSMPS</name>
          <displayName>DBGSMPS</displayName>
          <description>DBGSMPS register</description>
          <addressOffset>0x8c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x8000</resetValue>
          <fields>
            <field>
              <name>TESTDIG</name>
              <description>TESTDIG: SMPS TEST_DIG_3V3[3:0] SMPS control signal</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TESTKEL</name>
              <description>TESTKEL: SMPS TEST_KEL_3V3[1:0] SMPS control signal</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HOT_STUP</name>
              <description>HOT_STUP_3V3 SMPS control signal</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NO_STUP</name>
              <description>NO_STUP_3V3 SMPS control signal</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TESTILIM</name>
              <description>TESTILIM: SMPS TEST_ILIM_3V3 SMPS control signal</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTLRES_RAMP</name>
              <description>CTLRES_RAM_3V3 SMPS control signal</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIS_BIG_MOS</name>
              <description>DIS_BIG_MOS_3V3 SMPS control signal</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEST_OL</name>
              <description>TEST_OL_3V3 SMPS control signal</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIS_ILIM</name>
              <description>DIS_ILIM_3V3 SMPS control signal</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ILIM_BOOST</name>
              <description>ILIM_BOOST_3V3 SMPS current limitation Boost
- 0: Max current = 110mA (Default)
- 1: Max current = 130mA</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BOF_CUR_SEL</name>
              <description>BOF_CUR_SEL Bypass On the Fly current limitation 
- 00 : 20mA 
- 01 : 40mA
- 10 : 60mA (default)
- 11 : no limit</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRIMR</name>
          <displayName>TRIMR</displayName>
          <description>TRIMR register</description>
          <addressOffset>0x90</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x2304</resetValue>
          <fields>
            <field>
              <name>RFD_REG_TRIM</name>
              <description>RFD_REG_TRIM[2:0]: RF LDO Trimming
By default, this value is taken from the engi bytes; and saved on V12o domain when OBL done.
if associated ENGTRIM is enabled the RF LDO trimming can be controlled by the dedicated ENGTRIM register. Default= '100'.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPARE</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TRIM_MR</name>
              <description>TRIM_MR[3:0]: Main Regulator Voltage Trimming
By default, this value is taken from the engi bytes; and saved on V12o domain when OBL done.
if associated ENGTRIM.TRIMMREN is enabled the Main Regulator Voltage can be controlled by the dedicated ENGTRIM.TRIM_MR register. Default= '0000'.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SMPS_TRIM</name>
              <description>SMPS_TRIM[2:0]: SMPS Output Voltage Trimming
By default, this value is taken from the engi bytes; and saved on V12o domain when OBL done.
if associated ENGTRIM is enabled the SMPS output voltage can be controlled by the dedicated ENGTRIM register. Default= '011'.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BOF_TRIM</name>
              <description>BOF_TRIM[2:0]: Bypass On the Fly Output Voltage Trimming
By default, this value is taken from the engi bytes; and saved on V12o domain when OBL done.
if associated ENGTRIM is enabled the SMPS output voltage can be controlled by the dedicated ENGTRIM register. Default= '100'.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ENGTRIM</name>
          <displayName>ENGTRIM</displayName>
          <description>ENGTRIM register</description>
          <addressOffset>0x94</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>TRIMRFDREGEN</name>
              <description>TRIMRFDREGEN: trimming RFREG enabled
- 1: trimming bit applied from ENGTRIM register
- 0: trimming bit applied from OBL (can be read on TRIMR register)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIM_RFDREG</name>
              <description>TRIM_RFDREG:  RF Regulator Trimming
By default, this value is not applied, but taken from the engi bytes; if ENGTRIM.TRIMRFDREGEN=1, the startup current can be controlled by this register.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPARE</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIMMREN</name>
              <description>TRIMMREN: trimming MR enabled
- 1: trimming bit applied from ENGTRIM register
- 0: trimming bit applied from OBL (can be read on TRIMR register)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIM_MR</name>
              <description>TRIM_MR: Main Regulator Output Voltage Trimming
By default, this value is not applied, but taken from the engi bytes; if ENGTRIM.TRIMMREN=1, the startup current can be controlled by this register.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPSTRIMEN</name>
              <description>SMPSTRIMEN: trimming SMPS enabled
- 1: trimming bit applied from ENGTRIM register
- 0: trimming bit applied from OBL (can be read on TRIMR register)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPS_TRIM</name>
              <description>SMPS_TRIM: SMPS Output Voltage Trimming
By default, this value is not applied, but taken from the engi bytes; if ENGTRIM.SMPSTRIMEN=1, the SMPS output voltage can be controlled by this register.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DBG_STATUS_REG1</name>
          <displayName>DBG_STATUS_REG1</displayName>
          <description>DBG_STATUS_REG1 register</description>
          <addressOffset>0x98</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x202</resetValue>
          <fields>
            <field>
              <name>SMPS_FSM_STATE</name>
              <description>SMPS_FSM_STATE[2:0]: Indicates the current state of the SMPS FSM inside the PWRC.:
- 000: STARTUP
- 001: SMPS_REQ
- 010: SMPS_RUN
- 011: STOP
- 100: NOSMPS
- 101: PRECHARGE
- 110: NOSMPS_BOF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FLASH_FSM_STATE</name>
              <description>FLASH_FSM_STATE[2:0]: Indicates the current state of the FLASH FSM inside the PWRC:
- 000: STATE1: FLASH POR
- 001: STATE2: FLASH PWRUP
- 010: STATE3: FLASH READY
- 101: STATE4: FLASH SWITCH OFF
- 110: STATE5: FLASH PWR DOWN</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DBG_STATUS_REG2</name>
          <displayName>DBG_STATUS_REG2</displayName>
          <description>DBG_STATUS_REG2 register</description>
          <addressOffset>0x9c</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x201</resetValue>
          <fields>
            <field>
              <name>PMU_FSM_STATE</name>
              <description>PMU_FSM_STATE[3:0]: Indicates the current state of the PMU FSM inside the PWRC.
- 0000: POR
- 0001: RUN
- 0010: DS ENTRY
- 0011: WAIT1
- 0100: WAIT2
- 0101: WAIT
- 0110: WAIT3
- 0111: WAIT4
- 1000: ISOLATION
- 1001: DEEPSTOP
- 1010: SHUTDOWN
- 1011: DEEPSTOP EXIT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RAM_FSM_STATE</name>
              <description>RAM_FSM_STATE[1:0]: Indicates the current state of the RAM FSM inside the PWRC:
- 00: POR
- 01: POWER UP
- 10: READY
- 11: OFF</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ENGTRIM2</name>
          <displayName>ENGTRIM2</displayName>
          <description>ENGTRIM2 register</description>
          <addressOffset>0xa0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>BOFTRIMEN</name>
              <description>BOFTRIMEN: trimming BOF enabled
- 1: trimming bit applied from ENGTRIM2 register
- 0: trimming bit applied from OBL (can be read on TRIMR register)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BOF_TRIM</name>
              <description>SMPS_TRIM: SMPS Output Voltage Trimming
By default, this value is not applied, but taken from the engi bytes; if ENGTRIM.BOFTRIMEN=1, the SMPS output voltage can be controlled by this register.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
