KozhinovAlexander/zephyr_vscode_workspace/stm32_svd/STM32WL30.svd
        <register>
          <name>IO_IBER</name>
          <displayName>IO_IBER</displayName>
          <description>IO_IBER register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x000000000</resetValue>
          <fields>
            <field>
              <name>PA0_IBE</name>
              <description>PA0_IBE: Interrupt edge selection for Port A I/Os.
0: single edge detection.
1: both edges detection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA1_IBE</name>
              <description>PA1_IBE: Interrupt edge selection for Port A I/Os.
0: single edge detection.
1: both edges detection</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA2_IBE</name>
              <description>PA2_IBE: Interrupt edge selection for Port A I/Os.
0: single edge detection.
1: both edges detection</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA3_IBE</name>
              <description>PA3_IBE: Interrupt edge selection for Port A I/Os.
0: single edge detection.
1: both edges detection</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA4_IBE</name>
              <description>PA4_IBE: Interrupt edge selection for Port A I/Os.
0: single edge detection.
1: both edges detection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA5_IBE</name>
              <description>PA5_IBE: Interrupt edge selection for Port A I/Os.
0: single edge detection.
1: both edges detection</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA6_IBE</name>
              <description>PA6_IBE: Interrupt edge selection for Port A I/Os.
0: single edge detection.
1: both edges detection</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA7_IBE</name>
              <description>PA7_IBE: Interrupt edge selection for Port A I/Os.
0: single edge detection.
1: both edges detection</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA8_IBE</name>
              <description>PA8_IBE: Interrupt edge selection for Port A I/Os.
0: single edge detection.
1: both edges detection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA9_IBE</name>
              <description>PA9_IBE: Interrupt edge selection for Port A I/Os.
0: single edge detection.
1: both edges detection</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA10_IBE</name>
              <description>PA10_IBE: Interrupt edge selection for Port A I/Os.
0: single edge detection.
1: both edges detection</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA11_IBE</name>
              <description>PA11_IBE: Interrupt edge selection for Port A I/Os.
0: single edge detection.
1: both edges detection</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA12_IBE</name>
              <description>PA12_IBE: Interrupt edge selection for Port A I/Os.
0: single edge detection.
1: both edges detection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA13_IBE</name>
              <description>PA13_IBE: Interrupt edge selection for Port A I/Os.
0: single edge detection.
1: both edges detection</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA14_IBE</name>
              <description>PA14_IBE: Interrupt edge selection for Port A I/Os.
0: single edge detection.
1: both edges detection</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA15_IBE</name>
              <description>PA15_IBE: Interrupt edge selection for Port A I/Os.
0: single edge detection.
1: both edges detection</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB0_IBE</name>
              <description>PB0_IBE: Interrupt edge selection for port B I/Os.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                   0: single edge detection.
1: both edges detection.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB1_IBE</name>
              <description>PB1_IBE: Interrupt edge selection for port B I/Os.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                   0: single edge detection.
1: both edges detection.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB2_IBE</name>
              <description>PB2_IBE: Interrupt edge selection for port B I/Os.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                   0: single edge detection.
1: both edges detection.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB3_IBE</name>
              <description>PB3_IBE: Interrupt edge selection for port B I/Os.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                   0: single edge detection.
1: both edges detection.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB4_IBE</name>
              <description>PB4_IBE: Interrupt edge selection for port B I/Os.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                   0: single edge detection.
1: both edges detection.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB5_IBE</name>
              <description>PB5_IBE: Interrupt edge selection for port B I/Os.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                   0: single edge detection.
1: both edges detection.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB6_IBE</name>
              <description>PB6_IBE: Interrupt edge selection for port B I/Os.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                   0: single edge detection.
1: both edges detection.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB7_IBE</name>
              <description>PB7_IBE: Interrupt edge selection for port B I/Os.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                   0: single edge detection.
1: both edges detection.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB8_IBE</name>
              <description>PB8_IBE: Interrupt edge selection for port B I/Os.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                   0: single edge detection.
1: both edges detection.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB9_IBE</name>
              <description>PB9_IBE: Interrupt edge selection for port B I/Os.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                   0: single edge detection.
1: both edges detection.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB10_IBE</name>
              <description>PB10_IBE: Interrupt edge selection for port B I/Os.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                   0: single edge detection.
1: both edges detection.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB11_IBE</name>
              <description>PB11_IBE: Interrupt edge selection for port B I/Os.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                   0: single edge detection.
1: both edges detection.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB12_IBE</name>
              <description>PB12_IBE: Interrupt edge selection for port B I/Os.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                   0: single edge detection.
1: both edges detection.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB13_IBE</name>
              <description>PB13_IBE: Interrupt edge selection for port B I/Os.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                   0: single edge detection.
1: both edges detection.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB14_IBE</name>
              <description>PB14_IBE: Interrupt edge selection for port B I/Os.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                   0: single edge detection.
1: both edges detection.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB15_IBE</name>
              <description>PB15_IBE: Interrupt edge selection for port B I/Os.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                   0: single edge detection.
1: both edges detection.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
