KozhinovAlexander/zephyr_vscode_workspace/stm32_svd/STM32WL30.svd
        <register>
          <name>SEQ_INFO</name>
          <displayName>SEQ_INFO</displayName>
          <description>SEQ_INFO register</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SEQ_FSM_STATE</name>
              <description>Current state of the Sequencer
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEQ_EVENT_STATUS</name>
          <displayName>SEQ_EVENT_STATUS</displayName>
          <description>SEQ_EVENT_STATUS register</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SEQ_EVENT_STATUS</name>
              <description>Current value of the seq_event_status used by the Sequencer for next action mask comparison.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>STATIC</name>
      <groupName>STATIC</groupName>
      <baseAddress>0x49000400</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x40</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>PCKT_CONFIG</name>
          <displayName>PCKT_CONFIG</displayName>
          <description>PCKT_CONFIG register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x000103F1</resetValue>
          <fields>
            <field>
              <name>CRC_MODE</name>
              <description>CRC type (0, 8, 16, 16 802.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SECONDARY_SYNC_SEL</name>
              <description>In TX mode: this bit selects which synchro word is sent on the frame between SYNC and SEC_SYNC
</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNC_LEN</name>
              <description>Length of the SYNC (and secondary) SYNC word in 1-bit granularity
</description>
              <bitOffset>4</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNC_PRESENT</name>
              <description>Indicate if a SYNC word is present on the frame or not (null length)
</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEN_WIDTH</name>
              <description>Indicates if the LENGTH field is defined on 1 byte or 2 bytes
</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FIX_VAR_LEN</name>
              <description>Select the length mode
</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PREAMBLE_LENGTH</name>
              <description>Length of the PREAMBLE in pairs of bits (0 to 2046)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PREAMBLE_SEQ</name>
              <description>Select the PREAMBLE pattern to be applied
</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>POSTAMBLE_LENGTH</name>
              <description>Length of the POSTAMBLE in pair of bits (0 to 126 bits)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>POSTAMBLE_SEQ</name>
              <description>Packet postamble control: postamble bit sequence selection
</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNC</name>
          <displayName>SYNC</displayName>
          <description>SYNC register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x23232323</resetValue>
          <fields>
            <field>
              <name>SYNC</name>
              <description>Synchro word.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEC_SYNC</name>
          <displayName>SEC_SYNC</displayName>
          <description>SEC_SYNC register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SEC_SYNC</name>
              <description>Secondary Synchro word.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CRC_INIT</name>
          <displayName>CRC_INIT</displayName>
          <description>CRC_INIT register</description>
          <addressOffset>0xc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CRC_INIT_VAL</name>
              <description>CRC intialization value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PCKT_CTRL</name>
          <displayName>PCKT_CTRL</displayName>
          <description>PCKT_CTRL register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PCKT_FORMAT</name>
              <description>Packet format
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BYTE_SWAP</name>
              <description>Invert MSB-LSB transmission order (bitendianess)
</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FOUR_FSK_SYM_SWAP</name>
              <description>Invert bit to symbol mapping for 4-(G)FSK
</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_MODE</name>
              <description>RX mode
</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_MODE</name>
              <description>TX mode
</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WHIT_BF_FEC</name>
              <description>Whitening before FEC feature
</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WHIT_EN</name>
              <description>Whitening enable
</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WHIT_INIT</name>
              <description>Whitening initialization value.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CODING_SEL</name>
              <description>Coding / decoding selection
</description>
              <bitOffset>21</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MANCHESTER_TYPE</name>
              <description>Select the Manchester encoding polarity
</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INT_EN_4G</name>
              <description>This field is used as Interleaving enable for 802.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FEC_TYPE_4G</name>
              <description>FEC type for 802.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FCS_TYPE_4G</name>
              <description>FCS type value in header field for 802.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MOD_INTERP_EN</name>
              <description>Enable frequency interpolator (for 2-GFSK and 4-GFSK)
</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PN_SEL</name>
              <description>Select the Pseudo Random Binary Sequence (PRBS) polynomial to apply when the selected transmission mode is PN mode (TX_MODE = '11')
</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_2FSK_SYNC_MODE</name>
              <description>Force SYNC word to be formatted as a 2-(G)FSK bit steam instead of 4-(G)FSK
</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATABUFFER0_PTR</name>
          <displayName>DATABUFFER0_PTR</displayName>
          <description>DATABUFFER0_PTR register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DATABUFFER0_PTR</name>
              <description>Start address to be used by the Data Buffer0
</description>
              <bitOffset>2</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATABUFFER1_PTR</name>
          <displayName>DATABUFFER1_PTR</displayName>
          <description>DATABUFFER1_PTR register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DATABUFFER1_PTR</name>
              <description>Start address to be used by the Data Buffer1
</description>
              <bitOffset>2</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATABUFFER_SIZE</name>
          <displayName>DATABUFFER_SIZE</displayName>
          <description>DATABUFFER_SIZE register</description>
          <addressOffset>0x1c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DATABUFFER_SIZE</name>
              <description>Size of the Data Buffers (Data Buffer0 and Data Buffer1) expressed in byte unit.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PA_LEVEL_3_0</name>
          <displayName>PA_LEVEL_3_0</displayName>
          <description>PA_LEVEL_3_0 register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x230B0100</resetValue>
          <fields>
            <field>
              <name>PA_LEVEL0</name>
              <description>Output power level for first step
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA_LEVEL1</name>
              <description>Output power level for second step
</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA_LEVEL2</name>
              <description>Output power level for third step
</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA_LEVEL3</name>
              <description>Output power level for fourth step
</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PA_LEVEL_7_4</name>
          <displayName>PA_LEVEL_7_4</displayName>
          <description>PA_LEVEL_7_4 register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x51473B2F</resetValue>
          <fields>
            <field>
              <name>PA_LEVEL4</name>
              <description>Output power level for fifth step
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA_LEVEL5</name>
              <description>Output power level for sixth step
</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA_LEVEL6</name>
              <description>Output power level for seventh step
</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA_LEVEL7</name>
              <description>Output power level for eighth step
</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PA_CONFIG</name>
          <displayName>PA_CONFIG</displayName>
          <description>PA_CONFIG register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000015C</resetValue>
          <fields>
            <field>
              <name>PA_RAMP_STEP_WIDTH</name>
              <description>Step width (unit: 1/8 of bit period).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA_LEVEL_MAX_INDEX</name>
              <description>Final level for power ramping (i.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA_INTERP_EN</name>
              <description>Enable power level interpolator.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ASK_OOK_EN</name>
              <description>Enable the generation of the internal TXDATA signal provided to the FIR.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA_DRV_MODE</name>
              <description>Select the PA topology
</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA_MODE</name>
              <description>Configure the Power Amplifier (PA) mode
</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LIN_NLOG</name>
              <description>Enable/disable the linear-to- log conversion of the PA code output from Safe-ASK calibrator
</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA_RAMP_ENABLE</name>
              <description>Enable the power ramping
</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IF_CTRL</name>
          <displayName>IF_CTRL</displayName>
          <description>IF_CTRL register</description>
          <addressOffset>0x2c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x04CD04CD</resetValue>
          <fields>
            <field>
              <name>IF_OFFSET_DIG</name>
              <description>Intermediate frequency setting for the digital shift-to-baseband circuits (default: 300 kHz)
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IF_OFFSET_ANA</name>
              <description>Intermediate frequency setting for the synthesizer configuration (default: 300 kHz).</description>
              <bitOffset>16</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IF_MODE</name>
              <description>Select the cutoff frequency of the AAF for the analog RFSUBG IP
</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AS_QI_CTRL</name>
          <displayName>AS_QI_CTRL</displayName>
          <description>AS_QI_CTRL register</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x58008028</resetValue>
          <fields>
            <field>
              <name>RSSI_THR</name>
              <description>Signal detect threshold in 1 dB resolution.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PQI_THR</name>
              <description>PQI threshold (if 0 then ).</description>
              <bitOffset>9</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CS_MODE</name>
              <description>Carrier Sense mode selection
</description>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SQI_EN</name>
              <description>SQI enable
</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SQI_THR</name>
              <description>SQI threshold defining the precision requested to detect the SYNC word.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AS_EQU_CTRL</name>
              <description>ISI cancellation equalizer
</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AS_MEAS_TIME</name>
              <description>Select the RSSI measurement duration during Antenna switching procedure</description>
              <bitOffset>28</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AS_CS_BLANKING</name>
              <description>Blank received data if signal is below the CS threshold
</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
